INSERT INTO customer (firstName, lastname)
VALUES ('Иван', 'Иванов'),
       ('Мария', 'Смирнова'),
       ('Алексей', 'Кузнецов'),
       ('Ольга', 'Попова'),
       ('Дмитрий', 'Петров');

INSERT INTO product (name, price)
VALUES ('Телевизор', 30000),
       ('Холодильник', 25000),
       ('Стиральная машина', 20000),
       ('Ноутбук', 45000),
       ('Смартфон', 15000);

INSERT INTO purchase (customer_id, product_id, purchase_date)
VALUES (1, 1, '2024-07-15'),
       (2, 3, '2024-07-16'),
       (3, 2, '2024-07-17'),
       (4, 5, '2024-07-18'),
       (5, 4, '2024-07-19'),
       (1, 2, '2024-07-20'),
       (3, 5, '2024-07-21');